zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F84xxx/MC56F84769/codewarrior/MC56F84769_Vectors.c
/******************************************************************************************
    MC56F84769 startup code, default ISR and vector table for use with DSC compiler

    Version : 200525
******************************************************************************************/

/******************************************************************************************
    Copyright 2016-2025 NXP

    SPDX-License-Identifier: BSD-3-Clause
******************************************************************************************/

#include "Cpu.h"
#include "fsl_device_registers.h"
#include "fsl_clock.h"

#ifndef _lint

extern void init_56800_(void); /* Forward declaration of external startup function declared in startup file */

void Cpu_Interrupt(void);
#pragma interrupt alignsp saveall
void Cpu_Interrupt(void)
{
    asm(DEBUGHLT);
    /* Halt the core and placing it in the debug processing state. */
    /* Here should be two NOPs if DEBUGHLT is removed.
    asm(nop);
    asm(nop); */
}
#pragma interrupt off

static void default_interrupt(void)
{
    asm(DEBUGHLT);
    /* Halt the core and placing it in the debug processing state. */
    /* Here should be two NOPs if DEBUGHLT is removed.
    asm(nop);
    asm(nop); */
}

/*
 * CAUTION: _EntryPoint is called out of reset, .data, .bss, stack are not initiated
 * at this point, be careful to add/modify code in _EntryPoint. Say
 * 1. Don't call other functions,
 * 2. Don't use global or local variables.
 * 3. ...
 */
void _EntryPoint(void);
void _EntryPoint(void)
{
/* Disable constant to array reallocation compiler optimization before RAM is filled in startup */
#pragma constarray off

    COP->CTRL &= ~COP_CTRL_CEN_MASK; /* Disable COP */
    __DI();                          /* Disable interrupts of level 0,1,2 */

    /* PMC trim */
    PMC->CTRL &= ~PMC_CTRL_TRIM_MASK;
    PMC->CTRL |= SIM->NVMOPT2L & SIM_NVMOPT2L_PMC_BGTRIM_MASK;

    /* load factory trimming value of the internal relaxation oscillator */
    OCCS->OSCTL1 &= ~OCCS_OSCTL1_FREQ_TRIM8M_MASK;
    OCCS->OSCTL1 |= SIM->NVMOPT2H & SIM_NVMOPT2H_ROSC_8M_FTRIM_MASK;

    OCCS->OSCTL2 &= ~(OCCS_OSCTL2_FREQ_TRIM32K_MASK | OCCS_OSCTL2_TEMP_TRIM8M_MASK);
    OCCS->OSCTL2 |=
        (SIM->NVMOPT2H & SIM_NVMOPT2H_ROSC_8M_TTRIM_MASK) | (SIM->NVMOPT2L & SIM_NVMOPT2L_ROSC_32K_FTRIM_MASK);

    /* PLL is not enabled by default */
#if 0
    /* use internal 8M clock for PLL */
    OCCS->OSCTL1 &= ~(OCCS_OSCTL1_ROPD_MASK | OCCS_OSCTL1_ROSB_MASK); /* Enable internal 8M RC */
    OCCS->CTRL &= ~OCCS_CTRL_PRECS_MASK; /* Select internal 8M/400K RC OSC as MSTR_OSC */
    asm(NOP);
    asm(NOP);
    asm(NOP);
    asm(NOP);
    asm(NOP);
    asm(NOP);
    /* Output of PLL is SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY * 4, postscaler = 1 */
    OCCS->DIVBY = 0x2000U + (SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY*4UL/8000000UL-1U);
    OCCS->CTRL &= ~OCCS_CTRL_PLLPD_MASK; /* Power up PLL */
    OCCS->CTRL |= OCCS_CTRL_LCKON_MASK;  /* Enable LCKON */
    while ((OCCS->STAT & OCCS_STAT_LCK0_MASK) == 0) {}
    while ((OCCS->STAT & OCCS_STAT_LCK1_MASK) == 0) {}
    OCCS->CTRL |= OCCS_CTRL_ZSRC_MASK; /* Select PLL/2 as sys_clk_x2 to SIM */
    while((OCCS->STAT & OCCS_STAT_ZSRCS_MASK) != OCCS_STAT_ZSRCS(1U)) {}
#endif

    asm {
    swap shadows
    nop
    nop
    move.l #0, R0
    move.l #0, R1
    move.l #0, R2
    move.l #0, R3
    move.l #0, R4
    move.l #0, R5
    move.l #0, N
    moveu.w #65535, N3
    moveu.w #65535, M01
    nop
    nop
    swap shadows
    }

    asm(JMP init_56800_);
    /* Jump to C startup code */
}

/******************* Default ISR for ILLEGAL_OP **********************/

/* User could redefine ivINT_ILLEGAL_OP.
Please be noted that ivINT_ILLEGAL_OP can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_ILLEGAL_OP definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_ILLEGAL_OP(void);
__attribute__((weak)) void ivINT_ILLEGAL_OP(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for SWI3 **********************/

/* User could redefine ivINT_SWI3.
Please be noted that ivINT_SWI3 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_SWI3 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_SWI3(void);
__attribute__((weak)) void ivINT_SWI3(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for OVERFLOW **********************/

/* User could redefine ivINT_OVERFLOW.
Please be noted that ivINT_OVERFLOW can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_OVERFLOW definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_OVERFLOW(void);
__attribute__((weak)) void ivINT_OVERFLOW(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for MISALIGNED **********************/

/* User could redefine ivINT_MISALIGNED.
Please be noted that ivINT_MISALIGNED can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_MISALIGNED definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_MISALIGNED(void);
__attribute__((weak)) void ivINT_MISALIGNED(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for STPCNT **********************/

/* User could redefine ivINT_STPCNT.
Please be noted that ivINT_STPCNT can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_STPCNT definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_STPCNT(void);
__attribute__((weak)) void ivINT_STPCNT(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for BKPT **********************/

/* User could redefine ivINT_BKPT.
Please be noted that ivINT_BKPT can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_BKPT definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_BKPT(void);
__attribute__((weak)) void ivINT_BKPT(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for TRBUF **********************/

